package RegExРеджекси;

import java.util.regex.Matcher;
import java.util.regex.Pattern;


public class RegEx2ПростіПриклади {public static void main(String[]args){
//В даному прикладі показана проста  програма використання regex  як знаходить символи або строки у вибраному тексті і виводить номер їхньго розташування у тексті
    Pattern p = Pattern.compile("a");//Задається символ який потрібно знайти
    Matcher m = p.matcher("Jack is a boy");//Текст по якому буде іти пошук
    while (m.find()){
        System.out.println(m.start()+""+ m.group()+"");//Цикл виводу результату
    }
System.out.println("");

//В даному прикладі показана проста  програма пошуку слова у тексті
    Pattern p1 = Pattern.compile("boy");//Задається символ який потрібно знайти
    Matcher m1 = p1.matcher("Jack is a boy");//Текст по якому буде іти пошук
    while (m1.find()){
        System.out.println(m1.start()+""+ m1.group()+"");//Цикл виводу результату
    }
    System.out.println("");


//В даному прикладі показана проста  програма пошуку чилової операції
Pattern p3 = Pattern.compile("1\\+1=2");

    Matcher m3 = p3.matcher("1+1=2");

    while (m3.find()){
        System.out.println(m3.start()+""+ m3.group()+"");//Цикл виводу результату
    }
    System.out.println("");



    //В RegEx є символи які являються системними  []|^$.?*+()  задати їх в пошуку через RegEx можна застосовуючи екранування або вписати їх в дужки
    Pattern p5 = Pattern.compile("1\\+1=2");//Єкранування
    Pattern p6 = Pattern.compile("[+()]"); //Запис в дужках



    /*   абс ...	Листи
    123 ...	Цифри
\ d	Будь-який цифр
\ D	Будь-який нецифровий символ
.	Будь-який символ
\.	Період
            [abc]	Тільки a, b або c
[^ abc]	Не a, b, ні c
            [аз]	Символи від а до з
            [0-9]	Номери від 0 до 9
\ w	Будь-який буквено-цифровий символ
\ W	Будь-який неалфано-цифровий символ
    {m}	м Повторення
    {m, n}	m до n Повторення
*	Нульовий або більше повторень
    +	Один або кілька повторень
            ?	Необов'язковий персонаж
\ S	Будь-який пробіл
\ S	Будь-який символ без пробілів
            ^ ... $	Починається і закінчується
    (...)	Захоплення групи
    (a (bc))	Захоплення підгрупи
    (. *)	Захоплення все
    (abc | def)	Матчі abc або def*/








}
}
