package RegExРеджекси;

//RegEx1 Що таке регулярні вираження - це інструмент який в загальгому призначений  для перевірнки і редагування тексту відповідно певного шаблону
// тобто за допомогою даного інструменту можна перевірити чи відповідає даний тест певному(патерну) шаблону даний шаблон можна задати самому
// за допомогою даного інструмента можна швидко працювати з текстовими даними даний інстумент можна безпосередньо використати IJ
// Ctrl+F викликає вікно в якому можна виконувати пошук  Ctrl+R добавляє ще одну сроку у якій можна записати заміну за допомогою
// цього інструменту можна проводити  глобальне редактування тексту
// Можна виконати такі перевірки
// Чи є дана строка емейлом
// Чи є дана строка імям людини
// Чи є дана строка номером телефону
// І ще багато чого

public class RegEx1ЩотакерегулярніВираження {
    public static void main(String[] args){

        // Приклад використання RegEx для перевірки чи відподає введений тест заданому формату(патерну) повертає trye/false
        System.out.println("JAVA".matches("\\ b[A-Za-z0-9._%+-]+@[A-Za-z]{2,4}\\b"));
}}


