package Collections;

import java.util.*;

//Колекція це є по суті масив але без  заданої  довжини або клас який може зберігати обєкти, дані.У колекції довжина автоматично
// міняється добавляючи і забираючи з неї елементи
//Основна функція колекцій це зберігання обєктів.
//Java Collections Framework - набір зв'язаних класів та інтерфейсів, які реалізують commonly reusable collection структур даних
// Інтерфейси Iterable і Collection являють собою фундамент на якім побудований весь каркас колекцій так як він повинен бути
// реалізованим усіма класами колекцій

// Різновиди колекцій (інтерфейси які наслідуються від Collection крім Map)
//1)List(LincedList,Arraylist)
//2)Set
//3)Queue
//4)Map ;// Не наслідує інтерфейс Collection  але являється колекцією

//Колекції діляться на три типи: Неупорядковані,Упорядковані,Відсортовані


public class Collections1Begin {
    public static void main (String[] args ) {

        Collection collection = new ArrayList();//Просте створення колекції дана колекція представляє простий набір елементів
        Collection<String>collection1 = new ArrayList<>();//Створення колекції з використанням дженеріка в дану колекцію можна помістити тільки String

        //Collection collection; це є головний інтерфейс колекцій від якого наслідуються інші колекції



        //Основні методи колекцій в залежності від колекцій можуть дещо міняти свою назву
        collection.add("1");//Метод який добавляє новий елемент колецію
        collection.add("2");
        collection.remove("1");//Метод який видаляє елемент з колекції
        collection.size();//Метод який виводить кількість елементів у колекції
        collection.contains("1");//Метод який перевіряє чи є даний елемент в колекції(повертає trye/fals)
        collection.toArray(); //Метод який перетворює колецію в масив



        //Тут показоно метод пробігання по колекції з допомогою Iterator
        Iterator iterator = collection.iterator();//Створюється обєкт типу Iterator  і цьому присвоюється повернення методу iterator викликаному на колекції
        while (iterator.hasNext()){System.out.println(iterator.next());}//Пробігання по елеметам колекції циклом з виводом на екран

for (String s: collection1){System.out.println(s);}//Другий спосіб пробігання по колекції


//Пробігання по елеметам колекції циклом for
for (Object o:collection){
            System.out.println(o);
}


    }}
