package Collections;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.LinkedList;
import java.util.TreeMap;
//ст 498 Г.Шилд
//В даній програмі розлядаються основні алгоритми пошуку по колекціям
public class АлгоритмиПошукПоКолекціях {
    public static void main(String[] args) {

//1)Алгоритм(Константа) Constant- це алгоритм де можна знайти елемент колекції за одну операцію.
// Найшвидший алгоритм пошуку застосовується тоді коли знаємо в якім конкретно елементі колекції лежить елемент

//2)Алгоритм(логарифмічний)logarifmic- це алгоритм половинного ділення при пошуку елементів в колекціях.
// Застосовується тоді коли конкретно не знаєш в в якім  елементі колекції лежить елемент

//3)Алгоритм(лінійний) linear - це алгоритм лінійного пошуку елеметів пошук здійснюєтьться від першого по N елемент
// колекції поки не буде знайдено потрібний

//4)Алгоритм(квазілінійний)quaslinear -це алгоритм лінійного пошуку елеметів  з попереднім сортуванням пошук здійснюєтьться від першого по N елемент
// колекції поки не буде знайдено потрібний


//Використання алгоритмів пошуку в різних колекціях
        TreeMap<String,String> treeMap;//В даній колекції використовують логарифмічний метод пошуку
        LinkedList<String> linkedList;//В даній колекції використовують лінійний метод пошуку
        ArrayList<String> arrayList;//В даній колекції використовують лінійний метод пошуку
        HashMap<String,Integer> hashMap;//В даній колекції використовують лінійний метод пошуку










    }}
