package ГрафікаJAVA;

import javax.swing.*;

//JavaBeans являє собою клас подібний до інших класів який містить в собі готові графічні компоненти біни які можна використовувати для роботи
// з грачіними програмами. Тажож в данім класі можна створювати власні компоненти з власною логікою роботи або загружати дані компоненти і вподальшому
// використовувати їх у програмі.Компонент bean являє собою  компонент програмного забезпечення і призначений для багаторазового використання в багатьох середовищах
public class JavaBeans {
    private JButton button1;
    private JPanel panel1;
}
