package ГрафікаJAVA;



//В даній темі буде розглянуто обробник подій JAVA  це такий собі інтерфейс який звязує користувача з програмою який дозволяє
// користувачу користуючись клавіатурую і мишкою керувати прграмою.
//Подія це обєкт який описує зміну стану джерела
//Джерело це обєкт який генерує подію
 //Слухач це обєкт який повідомляється про подію(він повинен бути зареєстрованим джерелом він повинен реалізувати методи для отримання і реалізації подій)
// Класи подій gerbert-shildt polnyj-spravo ст 556
//Клас роботи з мишкою ст 662

public class ОбробкаПодій {
}
