package АбстрактніКласи2;


public abstract class Animal {
int age = 10;

    public void eat(){
    System.out.println("I am eating");
}







public abstract void makeSound();//Створення абстрактного методу який буде передаватись при наслідуванні клас який
    // наслідує даний клас обовязково повинен реалізовувати цей метод.
    // (Абстрактний метод може бути створений тільки у абстрактному класі)
    // (Абстрактний метод не має тіла реалізації{} він каже що даний метод обовязково
    // повинен бути релізоватий у класі а реалізовуйте його як хочете)
}
