package SOLID;
//SOLID — це абревіатура складена з перших літер п'яти базових принципів об'єктно-орієнтованого програмування та дизайну
// запропонована Робертом Мартіном. Принципи SOLID використовуються для дизайну та розробки таких програмних систем,
// які, з великою ймовірністю, зможуть тривалий час розвиватися, розширятися і підтримуватися.
// SOLID це такий принцип побудови архітектури програми

//1)Принцип даної архітектури принцип єдиного обов'язку (Single responsibility principle).Кожен об'єкт має виконувати
// лише один обов'язок.
public class Solid1SingleResponsibility {

}
