package String;

/**
 * Created by Гріша on 29.07.2017.
 */
public class Методи {public static void main(String[] args){
    String s =new String("Java");
    String s1 ="Hellow World";
    String s2 ="";


s.charAt(1);//Даний метод приймає індекс і повертає символ
    s.codePointAt(1);//Даний метод приймає індекс і поветає юнікод символа
    s.compareTo("");//Даний метод приймає строку(обєкт) і виконує порівняння строк
    s.compareToIgnoreCase("");//Даний метод приймає строку(обєкт) і виконує порівняння строк без урахування регістру
    s.concat("");//Метод який додає дві строки ідентично s+s1
    s.equals(s);//Даний метод приймає другий обєкт і порівнює їхній вміст
    s.equalsIgnoreCase(s);//Даний метод приймає другий обєкт і порівнює їхній вміст без врахування регістру
    s.hashCode();//Даний метод повертає хеш код обєкта
    s.indexOf(93);//В даний метод запсується код сивола і він перевіряє чи є у строці даний сивол з таким юнікодом
    s.isEmpty();//Даний метод перевіряє чи єдана строка пустою "";
    s.length();//Даний метод поветає число сиволів у строці

//Використання методу split даний метод розділяє окремі слова тексту на елементи масиву Sring даний метод приймає
// значення символ який буде розділювачем в данім масиві
   // String str= new String("Hot Java PHP MySQL HTML ");
    //String [] strings = str.split(" ");

   // for (String element:strings){
       // System.out.println(element);
   // }

s1.substring(1,5);//Даний метод вирізає кусок із строки по заданим індексам


    //s1.toCharArray();//Даний метод розбиває сроку на масив символів
//char [] chararray = s1.toCharArray();
   // for (char element:chararray){System.out.println(element);}

s.toUpperCase();//Переводить усі символи строки великими
s.toLowerCase();// Навпаки
s.trim();//Обрізає пробіли спочатку і в кінці строки


//Методи класу String
    String.valueOf(65);//Даний метод перетворює введені букви символи числа в строку



}}
