package ВнутрішніКласи;

//локальний клас це клас який працює на рівні метода являє собою по суті внутрішній клас тільки з деякими відміностями
public class ЛокальнийКлас {
    static int i=5;
    int j = 6;
    int a= 1;
    void rax(){}
    void does(){

        class Local{
            final static int q =4; //оголошення локального класу всередені методу
            int w = j;//даний клас має доступ до перемінних зовнішньго класу
            ЛокальнийКлас локальнийКлас = new ЛокальнийКлас();//можна створити обєкт зовнішньго класу
        
        }
    }


    public static void main(String[] args) {
        ЛокальнийКлас локальнийКлас1 = new ЛокальнийКлас();


    }
}
