package ЗахистІнформаціїШифруванняТаКриптографія;




//Після загрузки класу в віртуальну машину і його перевірки верифікатором в дію вступає третій механізм який забезпечує
//безпеку платформи JAVA який називається дипечер захисту (SecurityManager3) даний механізм являє собою клас який котролює дозволеність
// перечислених нище операці
//1)Створення потоком нового загрузчика класів
//2)Зупинка роботи віртуальної машини потоком
//3)Отримання класом доступу до члена другого класу
//5)Отримання класом доступу до локального файлу
//6)Відриття сокета для взаємодії віддаленим вузлом
//7)Запуск зласом завдання принтера
//8)Отримання класом доступу до ситемного буфера обміну даними
//9)Отримання класом доступу до черги подій AWT


//Використовуючи диспечер захисту дозволяє програмісту організовувати детальне керування окремими повноваженнями
//За умовчанням  при запуску програм JAVA ніякий диспечер доступу не використовується(тобто доступні усі операції) його можна встановити в програмі за
// допомогою статичного методу setSucurityManager() сласу System. Якщо в програмі уже заданий
// якись дипечер захисту то спроба встаноновити другий буде успішна тільки у випадку якщо перший
// диспечер одобрить таку заміну.



    //System.setSecurityManager(new java.lang.SecurityManager3()); //Влючення SecurityManager3



//Для налаштування SecurityManager3 портрібно провести наступні дії:
//Порібно зайти на наступний каталог (JAVA - jre1.8.0_151 - lib - security - файл java.security) - це є файл де прописані
// стандартні налаштування  безпеки менеджера безпеки Java в файлах java.policy розташовані самі дозволи бепеки
//В даному каталозі можна прописувати свої правила безпеки  через створення файлів  policy в яких задвати свою логіку потім даний файл
// треба включити в файл java.security і підключати їх до виконання програми методом System.setSecurityManager()


//Приклад програми з використанням роботи SecurityManager3
public class SecurityManager3 extends SecurityManager {public static void main (String[] args ){

    System.setSecurityManager(new SecurityManager3());//Влючення SecurityManager3
    System.out.println(System.getProperty("os.name"));







}}