package ЗахистІнформаціїШифруванняТаКриптографія;

/**
 * Created by Гріша on 07.12.2017.
 */
public class SecurityManagerАунтентификация {
}
//В загальному аутенфікація працює наступним чином: через  SecurityManager3 або через java.policy задаються певні рівні доступу і певні можливості
// різним обєктам аутинтефікований і не аутинфікований обєкт це обєкти які володіють певним набором можливостей даний набір можна задати через SecurityManager3.
 // Аутентифікація переводить обэкт з класу неатунтифікований у клас аутентифікований
