package ЗахистІнформаціїШифруванняТаКриптографія;

/**
 * Created by Гріша on 04.12.2017.
 */
public class ВерифікаціяБайтКоду2 {
}
//ВерифікаціяБайтКоду(Byte code verifier) являє собою другий механіз захисту в JAVA після (class loader) загрузчик класів
// ВерифікаціяБайтКоду яквляє собою механізм перевірки байт коду фактично порівння байткоду символів класу з  шаблоном
// заданим у віртуальній машині коли загрузчик класів передає віртуальній машині байт код
// він проходить перевірку(верифікацію).Верефікатор перевіряє усі класи за винятком системних.За умовчуванням верифікація включена
// завжди але її можна відключити за допомогою команди  noverify./
// /Верифікація призначена для захису від випадкових помилок в коді програми які можуть призвести до некоретної роботи програми,
// або як захист від зовнішньго впливу на програму з метою її проникнення в чужу систему

//Перелік перевірок які проводяться верифікатором
//1)Ініціалізація змінних перед їх використанням
//2)Узгодження типів змінних при виклику метода
//3)Дотримання правил доступу до зактритих полів данних і методів
//4)Відсутність переповнення стеку

//Процес зламу програми являє собою зміну байткода значень або символів у програмі через асемблер