package СловоFinal;

/**
 * Created by Гріша on 21.06.2017.
 */
public class Final {
    public static void main (String[] args ) {
        final int x=10;//Поле ініціалізовате при створенні
        System.out.println(x);

}}
class Test{
    public static final int CONSTANT=0;//Використання слова final при оголошенні змінної (поля класу) означає
    //що дана змінна є константою і не може змінюватись у ході виконання програми вона обовязково повинна буди ініціалізована (при створенні нових обєктів дане поле final не можна переініціоналізовувати)
    // у більшості випадків використовуєть при оголошенні статичних змінних для економії памяті.

}


