package Блоки;

/**
 * Created by Гріша on 17.07.2017.
 */
public class Bloci {
    int a;
    int b;
    {}//Обявляється блок ініціалізації
    {System.out.println("Блок ініціалізації");}//Простий блок ініціалізації він буде викликаний(функція яка в ньго записана)
                                              // тільки при створенні обєкта цього класу

    static {System.out.println("Статичний блок ініціалізації");}// Статичний блок ініціалізації він буде викликаний(функція яка в ньго записана)
                                                               //при першому зверненні до класу
    {int x=10;int i = a = x;}  //Блоки використовуються преважно для ініціалізації змінних в обєктах або в класах


}
