package ХорошийКод;


       //В даній програмі показані загальні рекомендарії по роботі з обєктами
public class BestPractice4СтворенняОбєктів {
    public static void main(String[] args) {
        String string2 = "asasassa";//Правильне створення строки
        String string = new String("asassa");//Неправильно. При такім створенні строки створється обєкт в памяті (неравильне використання памяті )

        Integer sum = 5;//Такий складний тип даних якщо немає потреби не потрібно використовувати томущо при роботі із таким змінними постійно створються обєкти
        int sum1 = 10;

    }


}
