package КласиОбгорткиПримітивнихТипів;

/**
 * Created by Гріша on 07.07.2017.
 */
public class Main {
    public static void main (String[]args){
int x =1;
Integer x2=new Integer(1);//В даному випадку ціле число виступає
                              //обєктом і на нім можуть бути викликані методи

        Integer x3 =123;//При такому записі обєкт створюється самотійно і в нього записуються примітивні дані

        int y =x2;//При даному присвоюванні примітив з обєкта розпаковується.



    }
}
