package АнонімніКласи2;


//Тут показано приклади використання анонімного класу ананомні класи фактично використовуються для оверайду методу коли потрібно реалізувати якись
// винятковй випадок роботи метода і при цьому не створювати для цього окремий клас
public class Main {
    public static void main(String[] args) {
Dog dog = new Dog();
Dog dog1 = new Dog(){void saySound(){System.out.println("May");};//Застосування анонімного класу для перевизначення методу на окремому обєкті )
}; // Створення аннонімного класу  і оверайд методу (фактично оверайд методу на обєкті)
    dog.saySound();
    dog1.saySound();




//Другий спосіб застосування анонімного класу для перевизначення методів інтерфейса без імплементації класом
// (не потрібно створювати оремий клас і у нім перевизначати метод)

    Amimal1 amimal1 = new Amimal1() {
            @Override
            public void eat() {System.out.println("Somting eating");

            }
        };
amimal1.eat();

    }}
